### Instruções:

- Deixe o arquivo `.csv` apenas com os dados, sem o cabeçalho;
- Deixe todas as colunas formatadas como `Geral` no Excel, exceto o campo de data, que deve ficar no formato de `Data Abrevidada`;
- Certifique-se de que o arquivo `etl.csv` está no mesmo diretório do script.

In [ ]:
# Imports necessários
import pandas as pd

In [ ]:
# Ler o arquivo CSV
df = pd.read_csv('etl.csv', sep=';', names=['data_venda', 'num_nota', 'cod_cliente', 'cod_produto',
                                              'qtd', 'vl_unit', 'custo_medio', 'id_empresa'])

In [ ]:
# Converter colunas para os tipos corretos

# String
df['num_nota'] = df['num_nota'].astype(str)
df['cod_cliente'] = df['cod_cliente'].astype(str)
df['cod_produto'] = df['cod_produto'].astype(str)

# Trocar ',' por '.'
df['vl_unit'] = df['vl_unit'].str.replace(',', '.')
df['custo_medio'] = df['custo_medio'].str.replace(',', '.')
df['qtd'] = df['qtd'].str.replace(',', '.')

# Float
df['vl_unit'] = df['vl_unit'].astype(float)
df['custo_medio'] = df['custo_medio'].astype(float)
df['qtd'] = df['qtd'].astype(float)

In [ ]:
# Visualizar os dados
df.head()

,data_venda,num_nota,cod_cliente,cod_produto,qtd,vl_unit,custo_medio,id_empresa
0,02/06/2025,74495,MUND27,8,10.0,75.00,40.500,2
1,02/06/2025,74495,MUND27,34,10.0,150.00,90.125,2
2,02/06/2025,74495,MUND27,37,15.0,70.00,42.630,2
3,02/06/2025,74501,RAPPI BARRA3,419,4.0,1.75,1.032,2
4,16/06/2025,74839,SAGA,3901,0.2,5.20,20.780,2

In [32]:
# Função para formatar cada linha no formato desejado para o comando SQL
def formatar_linha(row):
    return "('{}', '{}', '{}', '{}', {}, {:.2f}, {:.2f}, {}),".format(
        row['data_venda'], 
        row['num_nota'], 
        row['cod_cliente'], 
        row['cod_produto'], 
        row['qtd'], 
        row['vl_unit'], 
        row['custo_medio'], 
        row['id_empresa']
    )

# Aplicando a função para formatar todas as linhas
resultado = df.apply(formatar_linha, axis=1)

# Começando o comando SQL
sql_comando = "INSERT INTO fato_venda_cd (data_venda, num_nota, cod_cliente, cod_produto, qtd, vl_unit, custo_medio, id_empresa)\nVALUES "

# Concatenando todas as linhas formatadas no comando SQL
sql_comando += "\n".join(resultado)

# Removendo a vírgula após o último valor
sql_comando = sql_comando.rstrip(',')

# Exibindo o comando SQL final
print(sql_comando)

INSERT INTO fato_venda_cd (data_venda, num_nota, cod_cliente, cod_produto, qtd, vl_unit, custo_medio, id_empresa)
VALUES ('02/06/2025', '74495', 'MUND27', '8', 10.0, 75.00, 40.50, 2),
('02/06/2025', '74495', 'MUND27', '34', 10.0, 150.00, 90.12, 2),
('02/06/2025', '74495', 'MUND27', '37', 15.0, 70.00, 42.63, 2),
('02/06/2025', '74501', 'RAPPI BARRA3', '419', 4.0, 1.75, 1.03, 2),
('16/06/2025', '74839', 'SAGA', '3901', 0.2, 5.20, 20.78, 2)